### Manipulação de Dataframes

Ocorrem semelhante a manipulações de conjuntos

In [4]:
import pandas as pd

In [11]:
df1 = {
    "Nome" : ["João", "Pedro", "Marcelo"],
    "Idade" : [10, 20, 30],
    "Cidade" : ["Belo Horizonte", "Rio de Janeiro", "São Paulo"]
}

df1 = pd.DataFrame(df1)

print(df1)

df2 = df1.copy()

print(df2)

      Nome  Idade          Cidade
0     João     10  Belo Horizonte
1    Pedro     20  Rio de Janeiro
2  Marcelo     30       São Paulo
      Nome  Idade          Cidade
0     João     10  Belo Horizonte
1    Pedro     20  Rio de Janeiro
2  Marcelo     30       São Paulo

Unir dataframes com base nas linhas (por baixo), e criar grupos para cada dataframe

In [14]:
pd.concat([df1, df2])

      Nome  Idade          Cidade
0     João     10  Belo Horizonte
1    Pedro     20  Rio de Janeiro
2  Marcelo     30       São Paulo
0     João     10  Belo Horizonte
1    Pedro     20  Rio de Janeiro
2  Marcelo     30       São Paulo

In [23]:
df1.append(df2)

      Nome  Idade          Cidade
0     João     10  Belo Horizonte
1    Pedro     20  Rio de Janeiro
2  Marcelo     30       São Paulo
0     João     10  Belo Horizonte
1    Pedro     20  Rio de Janeiro
2  Marcelo     30       São Paulo

In [28]:
df = pd.concat([df1, df2], keys = ["df1", "df2"]) # cria grupos para cada df concatenado
print(df)

df.loc["df2"] # acessa um df em específico

          Nome  Idade          Cidade
df1 0     João     10  Belo Horizonte
    1    Pedro     20  Rio de Janeiro
    2  Marcelo     30       São Paulo
df2 0     João     10  Belo Horizonte
    1    Pedro     20  Rio de Janeiro
    2  Marcelo     30       São Paulo

      Nome  Idade          Cidade
0     João     10  Belo Horizonte
1    Pedro     20  Rio de Janeiro
2  Marcelo     30       São Paulo

Unir dataframes com base em uma coluna específica

In [29]:
pd.merge(df1, # tabela esquerda
         df2, # tabela direita
         on = "Nome", # coluna de base 
         how = "left") # left, right, inner ou outer join

      Nome  Idade_x        Cidade_x  Idade_y        Cidade_y
0     João       10  Belo Horizonte       10  Belo Horizonte
1    Pedro       20  Rio de Janeiro       20  Rio de Janeiro
2  Marcelo       30       São Paulo       30       São Paulo

### Alterar formato dos dataframes

Converte dataframes de formado long para wide, ou seja, acrescenta mais linhas (e menos colunas) e vice-versa

Sempre utiliza como base uma variável categórica que assumirá o nome das novas colunas (names);

As novas colunas conterão valores de outra coluna antiga que será apagada (values);

Converte df de long para wide

In [36]:
df1 = pd.pivot(df1,
         index = "Nome", # índice do novo dataframe formatado
         columns = "Cidade",
         values = "Idade")
df1

Cidade   Belo Horizonte  Rio de Janeiro  São Paulo
Nome
João               10.0             NaN        NaN
Marcelo             NaN             NaN       30.0
Pedro               NaN            20.0        NaN

Converte df de wide para long

In [49]:
pd.melt(df1)

  variable           value
0     Nome            João
1     Nome           Pedro
2     Nome         Marcelo
3    Idade              10
4    Idade              20
5    Idade              30
6   Cidade  Belo Horizonte
7   Cidade  Rio de Janeiro
8   Cidade       São Paulo

In [43]:
df = df.stack() # Cria uma coluna com os nomes das variáveis, e outra com os valores obtidos
df

df1  0  Nome                João
        Idade                 10
        Cidade    Belo Horizonte
     1  Nome               Pedro
        Idade                 20
        Cidade    Rio de Janeiro
     2  Nome             Marcelo
        Idade                 30
        Cidade         São Paulo
df2  0  Nome                João
        Idade                 10
        Cidade    Belo Horizonte
     1  Nome               Pedro
        Idade                 20
        Cidade    Rio de Janeiro
     2  Nome             Marcelo
        Idade                 30
        Cidade         São Paulo
dtype: object

In [44]:
df = df.unstack()
df

          Nome Idade          Cidade
df1 0     João    10  Belo Horizonte
    1    Pedro    20  Rio de Janeiro
    2  Marcelo    30       São Paulo
df2 0     João    10  Belo Horizonte
    1    Pedro    20  Rio de Janeiro
    2  Marcelo    30       São Paulo